# config.py

class Config:
    """
    一个专门用于保存所有应用程序配置的类。
    这样做的好处是，所有可调整的路径和参数都集中在一个地方，方便修改。
    """
    # 【修改】要下载的用户数字ID列表。
    USERS_ID = [
        560647,             # 坂坂白
        2075682,            # Kitaro绮太郎
        31968078,           # 粽子淞
        4096581,            # 病院坂saki
        35117822,           # 好喜欢蜜桃四季春
        305956876,          # 腥味猫罐


        10982073,           # 明前奶粉罐
        3461567555307880,   # 羲拉C3C

        555683603,          # 玛丽兰想当玛丽苏
        3546937055775240,  # Yasal_170
        3546938211305491,  # beatberry314
    
        356010767,          # 走路摇ZLY
        836885,             # 清和Alicia
        21876627,           # -谢安然-
        
        498099165,          # 一颗小兔娘
        210752,             # 真栗
        100201761,          # 听霜_
        16322326,           # 丝言不吃包子
        9293142,            # 宫本樱樱酱

    ]
    
    # 【新增】用户ID到文件夹名称的手动映射。
    # 当API无法获取用户名时，程序会优先使用这里的名称。
    # 键必须是字符串形式的数字ID，值是您希望使用的文件夹名。
    USER_ID_TO_NAME_MAP = {
        "560647": "坂坂白",
        "2075682": "Kitaro绮太郎",
        "31968078": "粽子淞",
        "4096581": "病院坂saki",
        "35117822": "好喜欢蜜桃四季春",
        "305956876": "腥味猫罐",
        "10982073": "明前奶粉罐",

        "3461567555307880": "羲拉C3C",

        "555683603": "玛丽兰想当玛丽苏",
        "3546937055775240":"Yasal_170",
        "3546938211305491":"beatberry314",
        
        
        "356010767": "走路摇ZLY",
        "836885": "清和Alicia",
        "21876627": "-谢安然-",
        
        "498099165": "一颗小兔娘",
        "210752": "真栗",
        "100201761": "听霜_",
        "16322326": "丝言不吃包子",
        "9293142": "宫本樱樱酱"
    }

    # 增量下载开关。如果设为 True，当程序遇到第一个已存在于本地的动态元数据时，
    # 将会跳过该用户的所有剩余动态，从而大大提高后续运行的效率。
    INCREMENTAL_DOWNLOAD = True
    
    # Cookie 文件路径，用于 gallery-dl 进行需要登录的访问
    COOKIE_FILE_PATH = "C:/Base1/bili/gallery-dl/space.bilibili.com_cookies.txt"
    
    # 图片和元数据保存的基础输出目录
    OUTPUT_DIR_PATH = "C:/Base1/bili/gallery-dl/bilibili_images"